[
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,810,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Paseo de Gràcia",
    "CALLE": "Paseo de Gràcia",
    "PLANTA": "4",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "10774",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "168",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "2",
    "BAÑOS": "2",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in paseo de Gràcia",
    "DESCRIPCIÓN": "Exclusive home of 125m2 built, distributed in a bright living room with access to a pleasant balcony. The kitchen is open plan and comes fully equipped with high-end appliances (including a Liebherr wine refrigerator). Through the distributor we access the night area, where we will find the master suite room with access to the balcony. This bedroom has a large dressing room and a complete bathroom with a shower. The second room is also double and has a full bathroom with a bathtub right in front. Both bedrooms have built-in wardrobes and are designed with high quality materials. All rooms have air conditioning and ducted heating, home automation, parquet floors, aluminum carpentry and double glazing. The elegant and exclusive roof terrace offers a unique space, with lots of vegetation and a wooden structure that surrounds the incredible pool, ideal for cooling off in the hottest months. Located in the heart of Barcelona, Paseo de Gracia is the most elegant and stately avenue in the city, and in one of the most sought-after locations for business. A very attractive commercial proposal. It offers a very comfortable life, with all services at your fingertips. Living on this avenue means enjoying exclusivity in the very center of the city. Enjoy the exquisite architecture of its modernist buildings such as Casa Batlló, Casa Milá or Casa Lleó Morera, mixed with buildings of the modern, classical and neoclassical style.  Its location enjoys excellent communication, and the unique experience of living on Paseo de Gracia; surrounded by the best fashion stores, hotels, high-class restaurants and the most representative examples of modernism. A luxury available to few.  The rehabilitation work of this traditional neoclassical building has been carried out to the highest standards and details. We have sought to merge what is most distinguished from the past and what is most functional from the future. Its design is totally avant-garde and has all the comforts of the most modern buildings.  In total, the estate presents 21 unique homes, a roof terrace with a pool and chill out area, an interior vegetable patio, a gazebo and common areas. Distributed over 5 floors plus attic, homes with 1, 2 or 4 bedrooms, some with a balcony and others with pleasant terraces. The exclusive penthouse, with one bedroom and access to an impressive terrace with unbeatable views, the best product for our most demanding clients.  Each type of home has its personality, different distribution and different surfaces, all built with high quality materials.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/98261311/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 2 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:40:48",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "Sant Gervasi - Galvany, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,495,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Sant Gervasi - Galvany",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Calvet",
    "CALLE": "Calle de Calvet",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "5599",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "267",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "5",
    "BAÑOS": "4",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Calvet",
    "DESCRIPCIÓN": "This magnificent apartment is located in one of the most prestigious areas of Barcelona, next to the Turó Park, and offers you an interior surface of 239 built sqm and a 116 sqm terrace that is a privilege to rest and enjoy the outdoors in the middle of the city. The surrounding area has numerous stores, services, restaurants, international schools, the Galvany market and public transport options.A large hall leads to a huge day area divided into several ambiences: a living room with fireplace and a dining room. This area is very quiet and has access to the wonderful terrace, facing the inner block courtyard. It's the perfect place to hold lively meetings and meals, play, put all kinds of plants and an urban garden or relax outdoors.If we return to the hall, a corridor leads us to the central part of the house, where we find a large kitchen with pantry and separate laundry area. It has direct access from the service elevator. On the other side there's an access to a nice 11 sqm patio that allows the entrance of natural light in this area. There's also a full bathroom that serves the day area.The back of the property is dedicated to the night area. The large master bedroom of 29 sqm the street, so it's very bright, and has its own dressing room and bathroom. There's also another double bedroom en suite with a dressing room, a double bedroom overlooking the patio and a single bedroom with access to the patio. A separate bathroom serves these 2 bedrooms.The apartment includes a parking space and a storage room in the same building. In addition, on the terrace there's another storage room of 7 sqm. It has parquet floors, air conditioning by splits and heating by radiators. It's located on the 1st floor of a building with elevator and concierge in the morning and afternoon.Do not hesitate to contact Bcn Advisors to visit this impressive property. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/102771649/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 4 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:40:59",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nLucas Fox Barcelona",
    "CATEGORÍA PROPIEDAD": "Diagonal Mar i el Front Marítim del Poblenou, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,245,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Diagonal Mar i el Front Marítim del Poblenou",
    "POSTCODE": "N/A",
    "DOMICILIO": "Passatge de Maria Llimona",
    "CALLE": "Passatge de Maria Llimona",
    "PLANTA": "N/A",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "5791",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "215",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "No",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Terraced house for sale in Passatge de Maria Llimona",
    "DESCRIPCIÓN": "PASSATGE MARIA LLIMONA. Imposing semi townhouse (triplex) with garage included for two cars in Diagonal Mar  Lucas Fox presents this exclusive townhouse located in Diagonal Mar, one of the best neighborhoods in Barcelona. The property is located on a very quiet street, so it offers an excellent family-friendly life near the best beaches and parks.  The property, which is divided into three floors, consists of 142 m 2 useful and 80 m 2 distributed between patios and terraces. In its access, a spacious entrance hall leads to a large dining room living room with direct access to the terrace and the kitchen, which, in turn, connects with the staff bedroom and the laundry area. On the ground floor, we have a nice welcoming patio next to the large kitchen to enjoy a coffee in the morning. In addition, we find a dining room, a guest bathroom and another terrace, as well as an access door to the garage and storage room. The first floor consists of another large living room with access to two terraces, one of them very spacious. The second floor houses the three bedrooms and the two complete bathrooms, one of them integrated into the main room. To the left of the entrance hall, we go to the night area, with two double bedrooms with private bathrooms and two double bedrooms with a large shared bathroom. All bedrooms are equipped with built-in wardrobes and are exterior, facing a large terrace. In the basement, the property includes a storage room and two large parking spaces with direct access from the property. In short, Diagonal Mar, Poblenou and Vila Olímpica are your best option to enjoy a privileged location by the sea. They are well-connected areas, with all amenities, shopping centers, entertainment venues and culture. Here you live a traditional, family-friendly and bohemian lifestyle, with luxurious amenities and spectacular views of the Mediterranean.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/101913750/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 1 day ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:01",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,450,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de València",
    "CALLE": "Calle de València",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "9684",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "253",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "4",
    "BAÑOS": "3",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de València",
    "DESCRIPCIÓN": "This outstanding brand new refurbished property is located one street away from Paseo de Gracia, in one of the most sought-after areas of Barcelona's Eixample. Luxury, comfort and a unique lifestyle come together in this property with 188.7 built interior sqm and a 124 sqm terrace. It's in the first floor of a modernist building with only one flat per floor and a lift that goes directly to the apartment. An impressive entrance hall welcomes us with a large window overlooking the courtyard that the flat enjoys. This has been renovated with teak wood and an imperial illuminated olive tree has been planted, which gives a unique zen feeling of peace, wellbeing and connection with nature when entering the flat. The fabulous living-dining room with beautiful hydraulic Nolla floors and coffered ceilings is a work of art in itself. This very spacious day area has an open-plan kitchen, designed by Poliform Alea Pro, with metallic finish, glass cabinets, Neolith worktop and Miele home appliances. A gallery space leads to the marvellous 124 sqm terrace, which overlooks the block courtyard. It's completely covered in teak wood and has plants with automatic watering system, lighting and sockets. No doubt, an oasis in the middle of the city where you can enjoy everything you can imagine in the open air. The night area is presided over by an incredible en-suite bedroom of over 30 sqm with a grandstand and 2 balconies facing the street. It includes a dressing room with a hand-brushed metal finish, with glass cabinets and an island for accessories. The second en-suite bedroom has access to the interior patio and the third double bedroom is interior, both with built-in wardrobes. In addition, there's a study which could be a fourth bedroom. The 3 bathrooms (two en-suite and one separate) have designer finishings such as Gessi Venti sanitary ware, Carrara marble floors with underfloor heating and porcelain tiles by Wow Factory and The mosaic Factory. The main bathroom has a bathtub and the others have shower trays. The entire apartment enjoys Nolla hydraulic floors in a variety of mosaics restored by a specialist, combined with natural wood herringbone parquet. The property is equipped with Biticino Living Now home automation system and ducted hot/cold air conditioning in two ambiences. It's worth noting that the entire lighting system has been designed specifically for the flat, with elements by Santa Cole, David Groppi, Contain, Luceplan, Catellani & Smith and Marset. This property enjoys an enviable location in Eixample's right side, very close to Paseo de Gracia, Rambla Catalunya and Avenida Diagonal. The surrounding area offers numerous services, shops, restaurants, top brand boutiques, prestigious institutions, a spectacular architectural heritage and multiple public transport options. Do not hesitate to contact Bcn Advisors to visit this property. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/105473433/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 4 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:02",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "L'Antiga Esquerra de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "750,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict L'Antiga Esquerra de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Gran Via de les Corts Catalanes",
    "CALLE": "Gran Via de les Corts Catalanes",
    "PLANTA": "8",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "7732",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "97",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "2",
    "BAÑOS": "2",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Penthouse for sale in Gran Via de les Corts Catalanes",
    "DESCRIPCIÓN": "Fantastic refurbished penthouse with terrace in a modernist building.This marvellous penthouse with 87 built interior sqm according to the Cadastre and a 9 sqm terrace offers you a unique experience in a building full of modernist details, immersing you in the elegance and charm of the past. With a privileged location just a 10-minute walk from the city center, the property is completely exterior and enjoys a radiant orientation that bathes every corner with natural light.As you enter the property, you will discover an intelligent layout that clearly divides the day and night areas. The semi-open kitchen welcomes you, followed by the cosy dining room and the living room with direct access to the south-west facing terrace. It's the perfect place to relax outdoors and enjoy unforgettable sunsets, with views of the city and the mountains.The night area consists of a large en-suite bedroom with bathroom, a medium sized bedroom, a full bathroom and a laundry room. The rooms are an oasis of sunshine and panoramic views, thanks to the absence of adjoining buildings on the side.The penthouse has undergone an exquisite refurbishment with top brand materials and incomparable qualities. The kitchen, by the prestigious Schmidt firm, has Bosch appliances, blending style and functionality in a unique space. The property also has Fujitsu ducted hot/cold air conditioning, Bticino design switches, electric adjustable Venetian blinds and parquet flooring.This penthouse is unique in the area, offering a completely sunny living experience. Located between the neighbourhoods of Sant Antoni and L'Antiga Esquerra de l'Eixample, the surrounding area offers a wide range of services, neighbourhood shops, top brand boutiques, shopping centres, bars, restaurants and public transport, very close to Plaza Universitat, Plaza Catalunya, Rambla Catalunya, Paseo de Gracia and the historic centre of Barcelona.Don't miss the opportunity to own this exceptional property. Contact us for more information and discover how you can turn this home into the setting of your dreams - welcome to your new oasis in Barcelona!On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/103930029/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 26 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:05",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "Sant Gervasi - Galvany, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,560,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Sant Gervasi - Galvany",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Ferrán Agulló",
    "CALLE": "Calle de Ferrán Agulló",
    "PLANTA": "5",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "6367",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "245",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "5",
    "BAÑOS": "4",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Ferrán Agulló",
    "DESCRIPCIÓN": "This property is located in one of the 4 streets of Turó Park, one of the most coveted residential areas of Barcelona. It's on the real 5th floor, so it's very bright and quiet. With 245 built sqm and 5 bedrooms, this is an ideal option for large families looking for an upscale home in Barcelona.At the entrance, a large hall leads us to the left to an open space currently used as a library, through which we reach the living-dining room. It's very spacious, receives a lot of natural light, has a south-west orientation and overlooks the street.Through the dining area we access the kitchen equipped with household appliances, which has space for a table. It has an adjoining utility room and a large storage space and pantry. Finally, there's a guest toilet and the service bedroom with its own bathroom.Towards the other side of the flat, we find an open space enabled for an office and, then, the night area. It's composed of the master bedroom en suite with bathroom and dressing area, 3 double bedrooms (one of them facing the block courtyard with a north-west orientation) and a separate bathroom. In the main bathroom, there's a sauna.The apartment is equipped with parquet floors, air conditioning hot/cold (by ducts in the night area and by split in the day area) and mechanised blinds. It's located in a classical noble building with concierge, 2 lifts and storage room.The surrounding area offers numerous shops, services, international schools and business schools. It is also very well connected to the city centre by Ferrocarrils de la Generalitat underground and bus.Do not hesitate to contact Bcn Advisors to request a visit to this flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/103739782/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 18 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:06",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nLucas Fox Barcelona",
    "CATEGORÍA PROPIEDAD": "Sant Gervasi - La Bonanova, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,000,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Sant Gervasi - La Bonanova",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Benedetti, 78",
    "CALLE": "Calle de Benedetti, 78",
    "PLANTA": "N/A",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "6849",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "292",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "4",
    "BAÑOS": "4",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "No",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Detached house for sale in calle de Benedetti, 78",
    "DESCRIPCIÓN": "This fabulous modern and functional detached house is divided into four floors and a solarium that communicate with each other by lift and stairs. Its total area is 455 m2, of which 113 m2 correspond to the garage for three cars and motorcycles and 77 m2 to storage space and laundry area. Built in 2004 on a plot of about 250 m2, it has a wonderful terrace of 157 m2 facing the sea with a jacuzzi and garden area. It is located in the La Bonanova neighbourhood, close to prestigious schools and universities, public transportation, shops, and medical and sports centers. This specific property, measuring 265 m2, is divided into three floors and offers a very functional design, with a result full of very cozy personality. The luminosity and tranquility of its rooms stands out, since they are all exterior. In addition, the house has exclusive amenities, such as a porch area with folding awnings with sofas, a table and unobstructed views; four double bedrooms; three bathrooms, and a toilet. Pedestrian access to the house is through a walkway. The ground floor, at street level, is an intermediate floor, with a entrance hall with a built-in wardrobe, an lift, stairs and a hallway that leads to a bathroom with a bathtub, an exterior double bedroom with a built-in wardrobe, and a double bedroom with a wardrobe. built-in and views of the sea and a bathroom with shower that we access from both rooms. Originally, the sea view bedroom was two separate bedrooms. For its part, this floor has wooden floors. The first floor consists of two exterior double bedrooms. One is used as an study and has access to the suite bathroom and the other is the master suite with views of the garden and the sea and a full bathroom with shower and dressing room. Like the previous one, this floor has wooden floors. The staircase and lift lead to its fantastic terrace, ideal for a solarium and a sun lounger area, behind which the outdoor air conditioning machines are located. The lower floor is located at garden level. On this floor, open concept with cream marble floor, we find a guest toilet; the modern kitchen with a dining area integrated into the island, high-end appliances, an American refrigerator and a 1.2 m hood; the dining room, and the cozy living room with large sliding doors and at the level of the wonderful 90 m2 terrace with wooden floor for exterior. The exterior area can be enjoyed all year round thanks to its great orientation and silence. The porch area stands out with its folding awnings, a large table and a chill out area with sofas, small tables and a jacuzzi, as well as unbeatable views of the Bellesguard tower, the work of Antoni Gaudí. One level below, the tree-lined garden offers privacy and a very enjoyable green space. The floor, accessible by lift and stairs, has a large multipurpose storage area of 77 m2 with a laundry area and a large private garage of 113 m2 for three cars, motorcycles, bicycles or scooters. The house has ducted air conditioning, heating through radiators with a mixed boiler, aluminum windows with double glazed glass, motorized blinds, security system and wooden floors, marble and stoneware floors. It is an extraordinary house with a garden, terrace, solarium and private garage in one of the best neighborhoods in Catalan capital. Contact us to visit this luxury home.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/103305568/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 2 months ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:10",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nLucas Fox Barcelona",
    "CATEGORÍA PROPIEDAD": "Sant Gervasi - La Bonanova, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,900,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Sant Gervasi - La Bonanova",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle d'Alcoi, 32",
    "CALLE": "Calle d'Alcoi, 32",
    "PLANTA": "N/A",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "5800",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "500",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "7",
    "BAÑOS": "7",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "No",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Detached house for sale in calle d'Alcoi, 32",
    "DESCRIPCIÓN": "This magnificent property has six spacious en-suite bedrooms plus a separate service room. All of them are exterior, allowing for abundant natural light. This guarantees comfort and privacy for each member of the household. On the ground floor, we have a spacious and bright living room that stands as the social heart of the property. This open-plan space is perfect for rest and leisure, as it has large windows that flood the room with natural light and open onto the front terrace. On this cozy terrace, an elegant chill out area has been arranged, ideal for enjoying moments of relaxation outdoors. The kitchen is equipped with high-end appliances and has direct access to the rear garden, as does the dining room living room. All of this creates a seamless connection between the indoor and outdoor spaces. The carefully designed rear garden features a lovely outdoor dining area, ideal for hosting al fresco meals during the warmer months. It also includes a pleasant garden area that provides a relaxing and green environment. These green spaces provide a sense of peace and well-being that creates a perfect setting. On the first floor, we find four spacious exterior double bedrooms equipped with built-in wardrobes to optimize storage space. Two of them have direct access to a private balcony from where natural light and unobstructed views can be enjoyed. Each room has been designed to offer maximum comfort, so cozy and functional spaces have been created. The second floor houses two spacious bedrooms, one of which is en suite with a private bathroom and all the necessary amenities. The other bedroom has great potential as it can be transformed into a suite with a dressing room through a small renovation. Both bedrooms have their own private terrace. On the upper floor we can see a spectacular perimeter terrace with impressive panoramic views of the mountains. This spacious and versatile outdoor space is perfect for enjoying moments of relaxation or contemplating the natural landscape in a private and exclusive setting. In addition, this corner lends itself to multiple uses, from an outdoor leisure environment to a quiet space where you can unwind. A swimming pool can be installed in the back garden area or in the front of the house. Please do not hesitate to arrange a viewing to get to know the property better!",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106139128/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 17 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:12",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,900,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle del Rosselló",
    "CALLE": "Calle del Rosselló",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "10857",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "175",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "2",
    "BAÑOS": "3",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle del Rosselló",
    "DESCRIPCIÓN": "This immaculate flat is located between Paseo de Gracia and Rambla Catalunya, one of the most prestigious locations in Barcelona in the upper part of Eixample's right side. The luxury refurbishment has taken care of all the details in conception, materials and finishings, highlighting the floors and ceilings designed exclusively for this property and the excellent marquetry work on the floors and carpentry.The property has 170 built interior sqm and a 10 sqm balcony. It occupies the entire \"Principal\" floor (first one) of a regal estate building that was completely refurbished in 2017 with lift and only one flat per floor. Its double orientation makes it a very bright property.A large entrance hall distributes the day and night areas on both sides. The large living-dining room is wonderful and enjoys very high ceilings that provide a great feeling of spaciousness and brightness. It has access to the balcony, facing east towards the street. The Bulthaup top of the range kitchen is very spacious, equipped with Gaggenau appliances and has a separate laundry room. A guest toilet completes this area.The night area consists of 2 en-suite bedrooms. The impressive master bedroom, which overlooks the west-facing courtyard, has a huge dressing room and a bathroom located in a beautiful gallery. The second bedroom also has a walk in wardrobe, as well as a private bathroom, and is interior.The flat is equipped with unique hand decorated floors and ceilings, restored original carpentry with double glazing, home automation system, ducted air conditioning and heating via wrought iron radiators. The surrounding area offers a wide variety of services and shops, top brand boutiques on Paseo de Gracia, Rambla Catalunya and Avenida Diagonal, prestigious institutions, restaurants and excellent public transport.Do not hesitate to contact Bcn Advisors to visit this apartment. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/105435068/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 1 month ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:16",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,545,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Girona",
    "CALLE": "Calle de Girona",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "7254",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "213",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Girona",
    "DESCRIPCIÓN": "This magnificent luxury apartment refurbished to the highest quality epitomizes sophistication and comfort. It's located at the beginning of the picturesque Carrer Girona, which is being transformed into a pedestrian street. It's an excellent and centrally area of the Eixample, very close to the city centre and the El Born neighbourhood, surrounded by restaurants, shops, cultural attractions, green spaces and public transport options.The property is located in a beautiful regal estate building in perfect condition, which maintains all the details of classic Barcelona architecture, with wooden gate, a traditional façade and cast iron balconies. It has a classic lift and a communal roof terrace. The flat is located on the \"Principal\" floor, the noblest and with 4-metre high ceilings that create an impressive feeling of spaciousness.The property has 185 built interior m², a lavish 40 m² terrace, two side patios totaling 10 m², and two balconies of 3.7 and 2.6 m², offering ample outdoor space for relaxation and entertainment. Upon entry, a grand hallway welcomes you, seamlessly connecting all areas of the home. The high ceilings and elegant design set a sophisticated tone that extends throughout the apartment.The day area, facing southwest towards the street, is a spacious and impressive living-dining room, which has natural light streaming through large glass doors that open onto two original balconies — ideal for enjoying a morning coffee and watching the world below go by. The living room connects to a bespoke designer kitchen, equipped with stylish sleek cabinetry, top-of-the-line appliances and a spacious island that serves as a casual dining area.The 3 bedrooms combine modern elegance with cozy warmth. The master suite is particularly impressive, featuring a king-sized bed, built-in closets, and a luxurious en-suite bathroom with a walk-in shower, marble vanity, separate toilet, and high windows that invite natural light. Also connected to the master is an impressive walk-in closet, with high-quality custom cabinetry and luxurious lighting. It has access to a study area that leads to the sensational terrace, a very quiet place to enjoy outdoor gatherings, lunches, dinners or simply relax.The additional bedrooms are equally well-appointed, with one offering an en-suite bathroom, while the other one shares the separate bathroom and toilet in the hallway. These rooms provide versatile options, easily transforming into a spacious office or home gym.The apartment's decor harmoniously blends contemporary and traditional elements, highlighted by high-quality finishes, natural materials and original features that reflect Barcelona's cultural richness, such as hardwood flooring, original tiles and ornaments. The property has all new installations: plumbing, gas, electricity, ventilation, ducted air conditioning and independent heating. So, this property maintains its classic charm while offering modern luxury.Do not hesitate to contact Bcn Advisors to get to know this excellent flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.Living in a luxury apartment on Girona Street in Barcelona offers an unparalleled experience. The prime location provides access to a variety of exclusive boutiques, cafés, and high-end restaurants. Additionally, the modern architecture and top-quality finishes ensure a sophisticated and comfortable atmosphere. The proximity to parks and cultural spaces allows residents to enjoy the vibrant life of Barcelona. Undoubtedly, it is a place that combines elegance, comfort, and a cosmopolitan lifestyle.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/101689754/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 1 month ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:18",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "Pedralbes, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,380,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Pedralbes",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Tòquio",
    "CALLE": "Calle de Tòquio",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "7077",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "195",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "No",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Tòquio",
    "DESCRIPCIÓN": "Exclusive property of 195 m² built located in a 1977 building in the Pedralbes neighborhood, notable for its excellent state of conservation. Located on the first exterior floor, the house has 3 large bedrooms and 3 bathrooms. The master bedroom is en-suite, with an elegant walk-in closet, providing exceptional storage space and privacy. In addition, it has a pleasant terrace and two parking spaces included in the price, which makes it a very attractive option. Among its most notable details, the property has built-in wardrobes, a storage room and is oriented to the south and east, ensuring optimal luminosity. Its individual heating system using a hot/cold pump and air conditioning provide thermal comfort throughout the year. Both the housing and the access are adapted for people with reduced mobility, guaranteeing greater accessibility. Located in a quiet and well-connected area, this property is surrounded by green areas and essential services, making everyday life easier. The proximity to public transport and shops adds additional value to its excellent location. Purchasing this property will not only offer you a comfortable and functional home, but also an excellent long-term investment. At Walter Haus, we will be happy to help you every step of the process to make this exclusive home yours.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106264161/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 2 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:26",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "Pedralbes, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,755,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Pedralbes",
    "POSTCODE": "N/A",
    "DOMICILIO": "Jardí de Tòquio",
    "CALLE": "Jardí de Tòquio",
    "PLANTA": "2",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "10357",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "266",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "5",
    "BAÑOS": "4",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in Jardí de Tòquio",
    "DESCRIPCIÓN": "Stunning brand new refurbished property in Pedralbes. This unique and exclusive upscale property is located in a privileged location next to the Cruz de Pedralbes, one of the most prestigious areas of Barcelona. It has 259,37 built interior sqm and a 14 sqm terrace. The flat is situated in an extraordinary building, catalogued as part of our valuable cultural heritage in the city of Barcelona. Its hexagonal design, with elegant natural wood lattices and large windows, is truly distinctive. In addition, the property has a charming garden and a communal swimming pool. The price includes 3 parking spaces, 2 of them inside the building and one more outside. Entering this property, you will find 5 bedrooms, including a maid's room with private bathroom. Two of these rooms are suites, guaranteeing privacy and comfort. In addition, there is a guest toilet, a bright living/dining room of 69 sqm with views of the swimming pool from the gallery, a modern kitchen adjoining the living room, a practical office, a laundry area and cupboards with a large storage capacity. The kitchen, from the prestigious Modulnova brand, is fully equipped with appliances from renowned brands such as Gaggenau and Siemens.The finishings of this property are top quality, with a comfortable, avant-garde and functional design. Every detail has been carefully selected to offer a luxurious ambience, from the wide-slat glued parquet flooring with a natural oak wood top layer to the micro-cement cladding and the large-format porcelain floor tiles. In addition, all the installations are designed to maximise energy efficiency, with ducted hot/cold air conditioning via a heat pump, aerothermal heating for domestic hot water and underfloor heating. Design, quality and comfort are in perfect harmony with the desires of the most exquisite tastes. In short, this is a flat designed to enjoy an exclusive, comfortable and elegant lifestyle, which perfectly reflects its privileged location and distinctive status. You are invited to discover the luxury and sophistication in every corner of this exceptional property!Do not hesitate to contact Bcn Advisors to visit this property. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106253657/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 1 month ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:31",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,350,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Paseo de Gràcia",
    "CALLE": "Paseo de Gràcia",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "11345",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "119",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "2",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in paseo de Gràcia",
    "DESCRIPCIÓN": "Spectacular luxury property on Paseo de Gracia, right in front of the iconic Casa Batlló. Located in a building designed by the prestigious architect Josep Puig i Cadafalch, this home combines history and modernity in its 119 m² built, offering an exclusive living experience in an incomparable location. The interior of the house is distributed in a large hall that gives access to an elegant day area with a living-dining room, connected to a period gallery. The semi-open kitchen, equipped with high-end appliances, adds a contemporary touch to the spaces. In addition, the property has a master suite with dressing room and bathroom, a second double bedroom and a third room with bathroom and dressing room. Located in one of the most exclusive neighborhoods in Barcelona, Paseo de Gracia, the property enjoys a privileged location close to luxury boutiques, fine dining restaurants and historical monuments, making it a perfect option for those looking to live in the heart of the city. At Walter Haus, we believe that this home represents an unmatched investment in style and comfort. We are at your disposal to help you turn this exclusive property into your next home.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106227283/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 1 day ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:33",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "Pedralbes, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,380,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Pedralbes",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Tòquio",
    "CALLE": "Calle de Tòquio",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "7077",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "195",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Tòquio",
    "DESCRIPCIÓN": "This bright flat with 190 built interior sqm, a 11 sqm terrace, 3 bedrooms and 2 parking spaces is located in a unique building in the Pedralbes neighbourhood, awarded for its design. The area is one of the most prestigious and quietest in Barcelona, ideal for those looking for the best comfort in their daily life. The entrance hall of the main entrance leads directly to the spacious double height living room, ideal for differentiating the living room and dining room areas. It has access to the pleasant terrace of 11 sqm, with space for table and chairs and views to an area with trees. In addition, there is a library area that cleverly occupies the space. The living room has stairs leading down to a second private access to the flat from the communal garden of the building. Returning to the entrance hall, we access the generously sized kitchen/diner, which has an adjoining utility room and toilet. There is also a third service entrance. The night area is completely exterior, so the bedrooms are very bright and overlook the garden area of the building. The spectacular and huge en-suite bedroom offers you everything you need to enjoy the day to day life: built-in wardrobes, dressing table, a large walk-in wardrobe and a private bathroom with hydro-massage bathtub and shower. The other 2 bedrooms are doubles and share a bathroom. The south-east orientation gives this flat an impressive natural light. It was refurbished in 1996 and is in impeccable condition. The flat is equipped with parquet floors, ducted hot/cold air conditioning, double glazed windows and iron security shutters. The price includes 2 parking spaces and a storage room. The flat is located on the first floor of a building with a FAD architecture award, which stands out for its natural stone cladding. It also has a communal garden, 2 lifts, concierge and surveillance cameras at the entrance and in the hall. The property is very close to the gardens of the Royal Palace of Pedralbes and the surrounding area has numerous green areas, services, 2 shopping centres, international schools, business schools and private medical centres. It is perfectly communicated with Avenida Diagonal as a way out of Barcelona and with public transport. Do not hesitate to contact Bcn Advisors to visit this flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106321776/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 11 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:34",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "Vila de Gràcia, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "655,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Vila de Gràcia",
    "POSTCODE": "N/A",
    "DOMICILIO": "Abdo Terradas",
    "CALLE": "Abdo Terradas",
    "PLANTA": "N/A",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "4456",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "147",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Duplex for sale in Abdo Terradas",
    "DESCRIPCIÓN": "This exclusive property is located in the heart of the charming neighborhood of Vila de Gràcia, just 200 meters from Paseo de Gracia. It is completely renovated with high quality materials and finishes. The distribution of the home extends over three independent floors with direct access from the street, which ensures absolute privacy and tranquility. It has been carefully designed to offer maximum comfort to the owner. It has two double bedrooms, one en suite, and on the ground floor, a large versatile space that can be adapted according to personal needs, either as an additional bedroom, cinema room or second living room. In addition, the house has a separate laundry area and three full bathrooms. It also offers the possibility of purchasing or renting a parking space on the property. Jatoba wood floors and Technal exterior carpentry are just some of the high-quality details. Other notable aspects include a central air conditioning system, motorized blinds and a reinforced door. The property has built-in wardrobes and a large glass floor area that floods the home with natural light. The location is ideal, with proximity to shops, entertainment venues, hospitals and green areas. Please do not hesitate to get in touch if you would like to arrange a visit to this property.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/103016589/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 16 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:36",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "Vila de Gràcia, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "655,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Vila de Gràcia",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle D'Abdó Terradas",
    "CALLE": "Calle D'Abdó Terradas",
    "PLANTA": "N/A",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "4456",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "147",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Duplex for sale in calle D'Abdó Terradas",
    "DESCRIPCIÓN": "This unique property in the area will make you feel at home in the heart of the city, very close to Avenida Diagonal and Paseo de Gracia. It's a recently refurbished triplex apartment with independent entrance from the street, a quiet semi-pedestrian street in the Gracia neighbourhood.The property is distributed over 3 floors. The main floor has a living-dining room that is on the corner and receives natural light from the street through large windows, a semi-open kitchen equipped with home appliances, a single bedroom with a built-in wardrobe and a complete bathroom with bathtub.The upper floor has a large office space and library, which takes advantage of the corridor that serves as a walkway above the main floor, which also incorporates a glass ground part that favours the entry of light to the floor below. The en-suite master bedroom has its own bathroom with shower. This floor is bright, as it overlooks the street.Finally, the lower floor is an open-plan, multi-purpose space that can be adapted to almost any use: cinema room, games room, large study, bedroom.. . It also has a full bathroom with shower and a laundry room.The property is very quiet and peaceful and is equipped with high quality materials and finishings: reinforced door, Jatoba wood parquet floors, air conditioning hot/cold by independent ducts on each floor, LED lights, Technal aluminium carpentry and motorised foscurit blinds.The property is situated in a building constructed in 2008. It's possible to buy or rent a parking space in the same building.This is a unique opportunity to live or invest in Gracia, with its charming and lively neighbourhood life in its streets, squares, bars and restaurants; services, shops and a wide range of public transport. Do not hesitate to contact Bcn Advisors to see this 3-storey apartment.On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/100686482/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 1 month ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:39",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,595,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Rambla de Catalunya",
    "CALLE": "Rambla de Catalunya",
    "PLANTA": "2",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "8351",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "191",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "4",
    "BAÑOS": "4",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in rambla de Catalunya",
    "DESCRIPCIÓN": "This stunning brand new refurbished flat with luxury finishings is located on Rambla Catalunya and Consell de Cent, both semi-pedestrian streets. It's a privileged location in the whole city, in the heart of Eixample, very close to the centre of Barcelona and surrounded by all the best services, shops, restaurants, leisure options and public transport.The property, with 190.7 built sqm, is located on the real second floor of a beautiful regal estate building from the beginning of the 20th century with a lift. The refurbishment and interior design, carried out by the prestigious Vilablanch studio, have been carefully designed with the highest quality materials and finishings, maintaining original elements such as the Catalan vault in the high ceilings of the living room and bedrooms.A spacious hallway distributes the day and night areas. The day area is a fabulous living-dining room measuring more than 30 sqm, which allows the two spaces to be differentiated. It has a gallery and a balcony overlooking Rambla Catalunya. It's a very bright space thanks to the large windows and its south orientation. The kitchen is semi-open to the hallway and is equipped with a central island and high-end home appliances.The night area is composed of 3 bedrooms. The impressive master suite includes a dressing room, a large bathroom with shower and a separate bathtub. Like the other en-suite bedroom, it overlooks the inner courtyard and is very quiet. There's also a guest toilet. Finally, from the stairs next to the kitchen we access an upper floor with a bedroom and a complete bathroom. This room could also be used as a study or office.The property is equipped with herringbone parquet flooring, hot/cold air conditioning and heating radiators.Living in a luxury property on Barcelona's iconic Rambla Catalunya offers an incomparable lifestyle. With a privileged location in the heart of the city, you enjoy easy access to exclusive shops, gourmet restaurants and cultural attractions. The modernist architecture and panoramic views of the city envelop you in an atmosphere of elegance and sophistication. This flat is located just 3 streets away from Plaza Catalunya, the city centre, and next to Paseo de Gracia, with its numerous top brand boutiques. You will be able to enjoy the best that Barcelona has to offer with all its intensity!Do not hesitate to contact Bcn Advisors to view this property. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/102256338/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 2 months ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:41",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,200,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Girona",
    "CALLE": "Calle de Girona",
    "PLANTA": "3",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "9160",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "131",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "2",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Girona",
    "DESCRIPCIÓN": "This sensational flat has an excellent location in Barcelona and is part of a comprehensive refurbishment project in a regal 1910 building with luxury flats. The building is on the corner of Carrer Girona, which is already being transformed into a pedestrian street and the works are almost finished, and Avinguda Diagonal, which is becoming a boulevard with a large pedestrian area, green areas and cycle lanes, greatly reducing vehicle traffic. You will be able to enjoy the best of Barcelona in an incomparable location: in the heart of Eixample, very close to Paseo de Gracia, the city centre and all the shops and services.A private entrance hall leads to the entrance hall and the hallway, which leads to the large living-dining room with balcony. It is corner, has great natural light, which is atypical in the area, and unique views with a lot of depth. Thus, it creates an extraordinary atmosphere that allows to clearly differentiate several areas. The kitchen is semi-open but occupies a very independent space, and next to it there is a laundry room.The night area includes three bedrooms. The outstanding master suite has an office area at the entrance, which divides the private bathroom and the bedroom. It has a balcony overlooking the street. In addition, there is an interior double bedroom and a medium-sized bedroom and a separate bathroom.The flat features the highest quality materials and finishings, as well as an interior design with attention to detail that will combine the classic elements of the regal estate buildings with the most modern. Large spaces and brightness will be important, achieving a balance between traditional elements such as the restored Catalan vaulted ceilings and the comfort and amenities of a new building: underfloor heating and hot-cold air conditioning powered by aerothermics (the latest technology in air conditioning systems that produces energy savings of between 60% and 70% compared to conventional systems), top-of-the-range Siemens appliances, natural wood parquet floors, entrance door with security lock, built-in wardrobes, porcelain tiling on the bathroom walls, Italian designer taps, LED lighting, fibre optic connection, Internet and TV signal sockets, etc.The building will have 2 lifts (the original one restored respecting its wooden cabin with a new mechanism and a completely new one), a concierge, an area for charging electric bicycles and a private modernist-vintage style gym with Catalan vault, hydraulic floors and a full bathroom.The extensive main façade of the building, as well as the many interior courtyards and the rear façade, provide the building with excellent lighting and ventilation. The unusual distance to the buildings parallel to the façade further enhances the feeling and perception of spaciousness. As this is a modernist building with important historical value, the interior design team has prioritised the recovery of some of the original elements. For example, a complete restoration and rehabilitation of the modernist stuccoes of the staircase core has been carried out; and in the independent vestibules, recovered hydraulic mosaic tiles will be installed to maintain the historical value of the property. In addition, the exterior joinery has been replaced with wooden windows and balconies with thermal break and laminated insulating glass. Do not hesitate to contact Bcn Advisors to visit this flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/101941647/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 25 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:45",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,550,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Plaza Tetuan",
    "CALLE": "Plaza Tetuan",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "9011",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "283",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "5",
    "BAÑOS": "4",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in plaza Tetuan",
    "DESCRIPCIÓN": "Majestic and elegant property with a large terrace in a regal estate building.This splendid property of 231 built interior sqm and large 76.7 sqm terrace stands out for its absolute elegance in the combination of its original features with the integral refurbishment that was carried out. It's located next to Paseo Sant Joan, a highly sought-after area of the Eixample with numerous shops, services, restaurants and public transport services in the surrounding area.The property is on the \"Principal\" floor (first one) of a regal estate building with a lift, so it enjoys high ceilings that give it a feeling of spaciousness and luminosity. A large entrance hall divides the day and night areas on both sides. To the right we access directly to the spacious and spectacular living room, which conveys a stately and modern air at the same time with its impressive coffered ceiling. The kitchen is independent, has a central island, is equipped with electrical appliances and has an adjoining laundry room and a storage room.The living room has a fantastic gallery, ideal for enjoying a more relaxed atmosphere. Through it, via some stairs, we reach the magnificent terrace, which overlooks the interior courtyard. A quiet place in the open air where you can enjoy lively meetings, meals, moments of relaxation and everything you want, creating different atmospheres to suit your needs. It also has a small kitchen and bathroom installed in a wood-panelled shed.To the left of the entrance hall we pass to the night area. At the back there is an office and library area which gives access on both sides to 2 double bedrooms. One of them is en suite with its own bathroom and the other one has a mezzanine, which allows us to use the lower area as a study and the upper one to place the bed. These 3 rooms have access to a 10.5 sqm balcony overlooking the street. The night area is completed with 2 double bedrooms, one single bedroom and a complete bathroom.The flat has undergone a complete refurbishment that has provided it with the latest technologies, offering maximum comfort. It is equipped with parquet flooring and ducted hot/cold air conditioning. It retains original period features such as coffered ceilings and the original restored wooden carpentry throughout most of the flat.The property is located in a listed regal estate building with an impressive entrance with large wooden doors on the façade and a second large glazed door, which give it a lot of splendour. It's a 15 minute walk from Plaza Catalunya and Paseo de Gracia, so you will have all the advantages of the city centre within walking distance.Do not hesitate to contact Bcn Advisors to visit this flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106004460/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 11 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:48",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "695,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de València",
    "CALLE": "Calle de València",
    "PLANTA": "6",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "8797",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "79",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "2",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Penthouse for sale in calle de València",
    "DESCRIPCIÓN": "Penthouse of 79 m² built, located in a listed modernist building from 1936, in the prestigious Quadrat d'Or in Barcelona. The house has 3 bedrooms, including a master suite, a medium-sized room with an en-suite bathroom and a single room, functionally distributed to maximize convenience and comfort. The space is divided into a day area that includes a living room with a Catalan volta ceiling, original floors and large windows facing south, offering abundant natural light and unobstructed views. The kitchen, equipped with Miele appliances, has access to an interior balcony used as a water area. In addition, the penthouse has two full bathrooms, an additional storage room and a large space on the roof, with access to two community terraces where you can enjoy unbeatable panoramic views of the entire city. The property has 24-hour surveillance cameras and a space on the ground floor to store bicycles, marble floors and a beautiful restored period elevator. Option to purchase a large parking space, or rent it for 160 euros per month, in an exclusive parking lot less than 100 meters from the property. Located between Paseo de Gracia and Rambla Cataluña, this penthouse is located in one of the most exclusive areas of Barcelona. Its central location allows you to enjoy a wide cultural, gastronomic and commercial offer, as well as excellent transport connections. This property offers a unique opportunity to live in a home full of character and with all the modern comforts. At Walter Haus, we are here to help you discover your new home in a prime location.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106061040/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 1 day ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:50",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,380,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Provença",
    "CALLE": "Calle de Provença",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "9794",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "243",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Provença",
    "DESCRIPCIÓN": "Spectacular and large apartment with terrace in Eixample.Wonderful refurbished property in the heart of the Eixample, next to Rambla Catalunya and just two streets away from Paseo de Gracia and La Pedrera. It's one of the most sought-after areas of Barcelona, surrounded by all the day-to-day services, shops of all kinds from neighbourhood shops to top brand boutiques, prestigious institutions and entities and perfect connection by public transport.This property occupies the entire \"Principal\" floor of the building (the first one) and has 220 built interior sqm and a 45 sqm terrace. The day area is a spacious living-dining room that communicates with the separate kitchen, fully equipped with household appliances. The living room has access to the pleasant and quiet terrace, facing the large inner courtyard of the block, which is the perfect place to hold meetings, eat or relax in the sun.The night area is dominated by a great master suite with its own bathroom and 2 large windows giving access to a balcony facing the street. The second bedroom is also en suite and exterior with access to the aforementioned balcony, while the third bedroom is double and interior. There's also a separtae bathroom and a guest toilet.The apartment has original recovered hydraulic floors, air conditioning hot/cold, bioethanol fireplace in the living room, boiler, wardrobes, Santos kitchen furniture and top of the range appliances (induction hob, extractor hood, fridge, freezer, oven, microwave and dishwasher), as well as video entry phone system.The building has been completely refurbished: new lift, new installations, façade, communal areas, staircase, hall and roof.Do not hesitate to contact Bcn Advisors to visit this flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/102772221/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 3 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:52",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,800,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Paseo de Sant Joan",
    "CALLE": "Paseo de Sant Joan",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "10182",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "275",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "7",
    "BAÑOS": "4",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in paseo de Sant Joan",
    "DESCRIPCIÓN": "Stunning and beautiful modernist property with terrace in Paseo Sant Joan.This outstanding property is located in one of the best modernist buildings in Barcelona, in Paseo Sant Joan and at the foot of the Arc de Triomf. It occupies the entire \"Princpal\" floor (1st) of the building and is made up of 2 joined registered entities: one facing the street, with a tourist licence, and the other facing the inner courtyard of the block, which is currently an office, although the entire property is for residential use.The property has a total area of 264 built sqm and a 15 sqm terrace facing the inner courtyard. In the half of the property with a tourist licence, there's currently an independent apartment of 50 sqm, but the whole area of 132 sqm could be recovered for tourist purposes.The interior of the property is spectacular: it has the highest ceilings in the building, the highest quality of coffered ceilings and a great beauty and variety of hydraulic floors in its rooms. It's equipped with gas heating by beautiful antique radiators and ducted air conditioning.The flat has a lot of layout options, due to its large surface and the fact that it occupies the whole floor of the building. The main living room is impressive from the floor to the ceiling, with the classic modernist building tribune, facing the street, decorated with beautiful stained glass windows. The kitchen is separate and has a water and boiler area next to it. In addition to the main living room, there are 7 more rooms: one facing the street, 3 facing the courtyard with access to the terrace and 3 interior rooms. There are also 3 bathrooms.On the other hand, the tourist apartment has a living-dining room with open kitchen, which gives access to a balcony, a double bedroom and a bathroom.The building, with a lift, stands out for the use of stucco on the first floors and exposed brick on the upper floors, the use of stone in the grandstand, the wonderful decoration of the façade and the forceful volumes. It's located close to the city centre and the Ciutadella park, with plenty of services, shops and public transport options in the surrounding area. Do not hesitate to contact Bcn Advisors to visit this flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/98491349/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 1 month ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:55",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,350,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Paseo de Gràcia",
    "CALLE": "Paseo de Gràcia",
    "PLANTA": "3",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "11739",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "115",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "2",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in paseo de Gràcia",
    "DESCRIPCIÓN": "This luxury flat is located on Paseo de Gracia, in a building designed by the prestigious architect Josep Puig i Cadafalch, opposite Casa Batlló and Casa Ametller. It is an enviable location in one of the best avenues in Europe, surrounded by all the amenities and services that a city like Barcelona has to offer.The flat is located on the real 3rd floor and is very quiet, as it overlooks the block's courtyard. A large entrance hall leads us to the 30 m2 living-dining room, which has a pleasant gallery area facing the courtyard. The kitchen is semi-open in the day area and is equipped with top of the range appliances. The apartment has 3 bedrooms. The master bedroom en suite is situated next to the living room and has a gallery overlooking the block courtyard, where we find the washbasin. On the other side is the shower. At the entrance of the flat there is a double bedroom and a single bedroom with en-suite bathroom. The luxury refurbishment stands out for its high quality materials and finishings. The flat is furnished and equipped with ducted air conditioning, underfloor heating by aerothermia and gas fireplace. In addition, the price includes a 15 sqm storage room on the roof of the building and a share in another flat in the building, currently rented, which reduces the community expenses to a minimum. It is worth mentioning the improvements made to the beams. Living in a luxury flat on Paseo de Gracia in Barcelona offers incomparable advantages. Located in the heart of the city, it offers access to exclusive boutiques, gourmet restaurants and emblematic modernist buildings such as La Pedrera and Casa Batlló. It also boasts excellent transport connectivity and a safe and elegant environment. The luxury flats in this area guarantee comfort, exclusivity and a sophisticated lifestyle in one of the best areas of Barcelona. Do not hesitate to contact Bcn Advisors to request a visit to this flat. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/105043094/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated more than 1 month ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:57",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "La Dreta de l'Eixample, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,660,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict La Dreta de l'Eixample",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de Casp",
    "CALLE": "Calle de Casp",
    "PLANTA": "1",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "5570",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "298",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "2",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de Casp",
    "DESCRIPCIÓN": "This comment was automatically translated and may not be 100% accurate.\n\n\n\nSee description in the original language\n\n\n\n\nImpressive luxury property is located in the coveted Eixample Dreta neighborhood just two blocks from Paseo de Grácia. With a spacious 137m2 built area plus a spectacular 161m2 terrace that enjoys plenty of sun.Entering through the hall, you head to the day area, which has a high-ceiling living room, a gallery-style dining room and an office space that opens to the terrace. The terrace itself is perfect for enjoying the outdoors and comes equipped with everything you need to relax and entertain guests.The kitchen, which also has access to a patio, includes a dining bar and is fully equipped with high-end appliances and has plenty of storage space.It consists of three bedrooms, one of them en suite with a dressing room and access to the terrace. The remaining rooms are one double and the other single. Both bathrooms have a shower.The building is regal in perfect condition and has an elevator. This property is an exceptional opportunity to live in a luxury residence in a highly sought-after location.Walter Haus Real Estate is a real estate group based in the main capitals of Spain, in Madrid, Barcelona and the Costa Brava.We have more than 20 years of experience, with a dynamic team of professionals with experience in personal advice in constant training and with a very specific specialization in each area of action, which allows us to find solutions to the needs of each client.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/103780867/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 16 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:41:59",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "El Gòtic, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "1,275,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict El Gòtic",
    "POSTCODE": "N/A",
    "DOMICILIO": "Paseo de Colom",
    "CALLE": "Paseo de Colom",
    "PLANTA": "2",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "9733",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "131",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "2",
    "BAÑOS": "2",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in paseo de Colom",
    "DESCRIPCIÓN": "Exclusive 131 m² apartment in the Gothic Quarter of Barcelona, completely renovated and furnished. This elegant property is located in a royal modernist style building in perfect condition and is located on a real fourth floor, accessible by elevator, offering maximum comfort and quality. Upon entering, a large hall leads to a spacious living room, decorated with warmth and good taste. This living room includes an open kitchen equipped with high-end appliances and a south-facing balcony, with unobstructed views of the port. Natural wood parquet floors and double-glazed windows ensure a cozy and sophisticated atmosphere in every corner.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106476051/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 2 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:42:05",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "Sant Gervasi - Galvany, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,500,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Sant Gervasi - Galvany",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle dels Valero",
    "CALLE": "Calle dels Valero",
    "PLANTA": "5",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "8929",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "280",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "4",
    "BAÑOS": "3",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Penthouse for sale in calle dels Valero",
    "DESCRIPCIÓN": "Exclusive 280 m² penthouse, facing four winds, is located a few steps from Turó Park, in a neoclassical building from the 1950s. Surrounded by gardens and with an elegant entrance hall, this building with only five neighbors guarantees privacy and tranquility, which makes it a unique place to live. The elevator takes you directly to a private hall that gives access to a spacious living room with 4-meter-high sloping ceilings and natural wood floors. From the living room there is access to a 20 m² terrace, perfect for enjoying the sun and views of the neighborhood. The dining room is connected to a fully equipped kitchen and the service area, which has a separate area. The sleeping area includes a master suite with a private 7 m² terrace, as well as two double bedrooms that share a full bathroom. The mansard roofs in this area add a distinctive touch. It also has a private interior patio, ideal for relaxing. The penthouse includes a large parking space and a private office on the ground floor that can be used as a storage room. Located in one of the most prestigious areas of Barcelona, next to Turó Park and surrounded by luxury boutiques and exclusive services, this property offers a quiet and accessible residential environment. At Walter Haus, we invite you to discover this exceptional penthouse and make it yours.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106483261/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 3 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:42:07",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "El Gòtic, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "765,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict El Gòtic",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle de la Mercè",
    "CALLE": "Calle de la Mercè",
    "PLANTA": "N/A",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "6955",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "110",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "2",
    "BAÑOS": "2",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle de la Mercè",
    "DESCRIPCIÓN": "Luxury apartment on Passeig de Colom with 180º panoramic views of the Port Marítim completely renovated. With a constructed area of 110 m², this property has been completely renovated and is ready to move into. This high-end apartment combines contemporary design with the charm of a neoclassical building from 1875, carefully updated to preserve its original architecture. The house has two double bedrooms, two full bathrooms and an elegant hall that leads to a large illuminated hallway with restored beams. In addition, it includes an ideal office space with access to a small patio. The open kitchen, equipped with high-end appliances, is integrated into the dining room and a bright living room with two balconies that offer impressive views of the port. Located in the Gothic Quarter, this apartment provides a unique experience of living in one of the most historic areas of Barcelona. Surrounded by restaurants, shops and monuments, the property offers a privileged location, with easy access to all parts of the city and a nearby public parking lot. At Walter Haus, we are delighted to offer you this exclusive investment opportunity in Barcelona. If you are looking for luxury, comfort and an unparalleled location, this two-bedroom, two-bathroom apartment is ideal for you.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106475860/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 2 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:42:09",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nBcn Advisors",
    "CATEGORÍA PROPIEDAD": "El Gòtic, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "789,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict El Gòtic",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle Ample",
    "CALLE": "Calle Ample",
    "PLANTA": "4",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "5090",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "155",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "Sí",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle Ample",
    "DESCRIPCIÓN": "Excellent and bright refurbished high floor flat close to the sea in downtown. This awesome flat is located in Barcelona's Gothic Quarter, a few steps from the sea, on the fourth floor of a refurbished 19th century building with lift. It has 142 m2 built interior, 3 bedrooms and double orientation that facilitates the luminosity and cross ventilation. It is ideal for living in the historical part of the city with all the comforts of today. The flat has been refurbished brand new with high quality materials and finishes. Original elements have been maintained, giving it a charming traditional touch: Catalan vaulted ceilings with wooden beams and exposed brick walls. The layout makes the most of the space and natural light, with day and night areas at both ends. The entrance hall leads to the day area, which is divided into two distinct areas. On the one hand, the living room is very pleasant and cosy, with plenty of natural light and a balcony overlooking the street, facing east. The kitchen with central island is semi-open and has a large space in front of it where a second table could be placed. It's equipped with Balay house appliances and Silestone worktop. The night area has 3 double bedrooms, 2 of which are en suite. The master suite is spacious, with an office area and bathroom with shower. It has 2 large windows with access to a balcony with clear views of a large west-facing block courtyard with many trees. The second suite, with its own bathroom with bathtub, and the third bedroom are interior. In addition, there are built-in wardrobes. The flat includes the main furniture. It's equipped with water resistant parquet floors, air conditioning hot/cold by splits in the living room and the 2 suites, and an alarm with option of subrogation without installation costs. The building has a fantastic communal roof terrace with views of the historic surroundings of downtown Barcelona. The surrounding area has a wide variety of shops and services, a shopping mall, entertainment venues such as the Soho House, historic streets and squares, and perfect communication with the rest of the city by public transport. Do not hesitate to contact Bcn Advisors to visit this property. On our website you will find many more properties than those published here and we also have an extensive private catalogue of properties that may fit what you are looking for.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106627212/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 2 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:42:10",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nWalter Haus Barcelona",
    "CATEGORÍA PROPIEDAD": "El Gòtic, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "789,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict El Gòtic",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle Ample",
    "CALLE": "Calle Ample",
    "PLANTA": "3",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "5090",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "155",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "3",
    "BAÑOS": "3",
    "TERRAZA": "No",
    "GARAJE": "No",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Flat / apartment for sale in calle Ample",
    "DESCRIPCIÓN": "Charming apartment of 155 m² built, completely renovated, brand new, located in a renovated royal building with an elevator located in the El Gótico neighborhood, it is a unique opportunity in the heart of Barcelona. The property is located in a building from 1863 and offers an optimal distribution for those seeking comfort and style in one of the most emblematic areas of the city. The property has a spacious living-dining room full of natural light that connects to a balcony overlooking the street, ideal for enjoying the vibrant atmosphere of the neighborhood. The open-plan kitchen, equipped with high-quality appliances, integrates perfectly into the space, creating a modern and cozy environment. The night area includes two double bedrooms en suite and a third bedroom with a separate bathroom. Located in the historic Gothic Quarter, this property places you in the heart of Barcelona, surrounded by a varied cultural, gastronomic and leisure offer. In addition, the proximity to the beaches of Barceloneta adds additional value to the lifestyle that this home offers. Acquiring this apartment is investing in quality of life and exclusivity. At Walter Haus, we make sure that every detail meets your expectations, offering you a home that combines elegance and functionality.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/106627368/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 2 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:42:12",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  },
  {
    "REF. PORTAL": "container",
    "NOMBRE": "N/A",
    "TELÉFONO": "N/A",
    "TIPO ANUNCIANTE": "Professional advertiser\n\n\nLucas Fox Barcelona",
    "CATEGORÍA PROPIEDAD": "Sant Gervasi - Galvany, Barcelona",
    "OPERACIÓN": "Venta",
    "PRECIO VENTA": "2,450,000 €",
    "PRECIO ALQUILER": "N/A",
    "COMUNIDAD AUTÓNOMA": "Cataluña",
    "PROVINCIA": "Barcelona region, Barcelona",
    "POBLACIÓN": "Barcelona",
    "COMARCA": "N/A",
    "BARRIO": "Subdistrict Sant Gervasi - Galvany",
    "POSTCODE": "N/A",
    "DOMICILIO": "Calle d'Aribau",
    "CALLE": "Calle d'Aribau",
    "PLANTA": "7",
    "AÑO CONSTRUCCIÓN": "N/A",
    "PRECIO POR M2": "6658",
    "CALIFICACIÓN ENERGÉTICA": "N/A",
    "SUPERFICIE CONSTRUIDA": "368",
    "M2 TERRENO / PARCELA": "N/A",
    "DORMITORIOS": "5",
    "BAÑOS": "6",
    "TERRAZA": "Sí",
    "GARAJE": "Sí",
    "TRASTERO": "No",
    "ASCENSOR": "Sí",
    "CARACTERÍSTICAS": "",
    "TÍTULO ANUNCIO": "Penthouse for sale in calle d'Aribau",
    "DESCRIPCIÓN": "This exceptional modern penthouse boasts a coveted position in the prestigious Galvany neighbourhood of Zona Alta, surrounded by upscale boutiques, fine dining establishments, and convenient access to public transportation. Spanning a total built area of 312 m², this residence includes an impressive 187 m² of terrace space, offering all-day sunshine and stunning panoramic views extending from the Agbar Tower to Tibidabo. Spread across three levels, the penthouse features a graceful marble staircase and a lift linking each floor seamlessly. Entering through the foyer on the first level, one discovers the luxurious main suite complete with a generous dressing room, private bathroom, and direct terrace access. Additionally, this floor houses a second suite with its own bathroom. Ascending to the second level reveals the expansive, fully-equipped kitchen, along with a separate service and utility area complemented by a terrace. This level also accommodates two bedroom suites and a spacious living room, equipped with a projector and divided into two distinct areas, both with access to the expansive terrace.    The third and final level is dedicated to a breathtaking space, featuring an indoor heated swimming pool, a bathroom, and an exquisite terrace-solarium offering panoramic vistas. In total, there are 5 bedrooms, including the service area. The property comes with a storage unit and includes the convenience of two parking spaces within the same building. Please contact us for further information.",
    "ORIGEN": "Idealista",
    "URL PORTAL": "https://www.idealista.com/en/inmueble/104871295/",
    "FOTOS": [],
    "LATITUD": "N/A",
    "LONGITUD": "N/A",
    "FECHA PUBLICACIÓN": "Listing updated 24 days ago",
    "FECHA EXTRACCIÓN": "2024-12-01 12:42:14",
    "VIGENTE": "Sí",
    "STATUS": "Activo"
  }
]